#include "delay.h"

//理解延时的原理，直接用  delay_ms delay_us()两个函数代替


void delay(unsigned long times)
{
   unsigned long i;
   for(i=0;i < times;i++);   	
}

//=====================================================================================
//函数: delay()
//功能：延迟		
//=====================================================================================
void delay_us(uchar n)
{
	unsigned long i;
	for(i=0;i < n;i++);
}

//=====================================================================================
//函数: delay()
//功能：延迟		
//=====================================================================================
void delay_900us(void)
{
	unsigned long i,j;
	for(i=0;i < 3;i++)
		for(j=0;j<50;j++);
}


